Tester/src/Catalogs/Scenarios/Scenarios.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scenarios</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Access</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Application</name>
    <type>
      <types>CatalogRef.Applications</types>
    </type>
  </attributes>
  <attributes>
    <name>Changed</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>LastCreator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Path</name>
    <type>
      <types>DefinedType.ScenarioPath</types>
    </type>
  </attributes>
  <attributes>
    <name>Script</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Severity</name>
    <type>
      <types>EnumRef.Severity</types>
    </type>
  </attributes>
  <attributes>
    <name>Sorting</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Spreadsheet</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Tag</name>
    <type>
      <types>CatalogRef.TagKeys</types>
    </type>
  </attributes>
  <attributes>
    <name>Template</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Tree</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <type>
      <types>EnumRef.Scenarios</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Areas</name>
    <attributes>
      <name>Name</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Top</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Left</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Bottom</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Right</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Users</name>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Tester/src/InformationRegisters/Editing/Editing.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Editing</name>
  <resources>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </resources>
  <resources>
    <name>Date</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Scenario</name>
    <type>
      <types>CatalogRef.Scenarios</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Tester/src/Catalogs/Versions/Versions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Versions</name>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Access</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Application</name>
    <type>
      <types>CatalogRef.Applications</types>
    </type>
  </attributes>
  <attributes>
    <name>Changed</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Folder</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LastCreator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Path</name>
    <type>
      <types>DefinedType.ScenarioPath</types>
    </type>
  </attributes>
  <attributes>
    <name>Scenario</name>
    <type>
      <types>CatalogRef.Scenarios</types>
    </type>
  </attributes>
  <attributes>
    <name>Script</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Severity</name>
    <type>
      <types>EnumRef.Severity</types>
    </type>
  </attributes>
  <attributes>
    <name>Spreadsheet</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Template</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Tree</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <type>
      <types>EnumRef.Scenarios</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Areas</name>
    <attributes>
      <name>Name</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Top</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Left</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Bottom</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Right</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Users</name>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Tester/src/Catalogs/Scenarios/Forms/Store/Module.bsl
&AtServer
var Stored;

// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	loadParams ();
	LockingForm.LoadScenarios ( ThisObject );
	AppearanceSrv.Read ( ThisObject );
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure loadParams ()
	
	JobPreparing = Parameters.JobPreparing;
	
EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure OK ( Command )
	
	AllScenarios = fetchScenarios ();
	Notify ( Enum.MessageSave (), AllScenarios );
	stored = store ();
	broadcast ( stored );
	Close ();
	
EndProcedure

&AtServer
Function fetchScenarios ()
	
	return new FixedArray ( LockingForm.FetchScenarios ( ThisObject ).UnloadColumn ( "Ref" ) );
	
EndFunction 

&AtServer
Function store ()
	
	BeginTransaction ();
	LockingForm.LockEditing ( scenariosTable () );
	userScenarios ();
	if ( not KeepLocked ) then
		unlockScenarios ();
	endif; 
	createVersions ();
	CommitTransaction ();
	return Stored;
	
EndFunction

&AtServer
Function scenariosTable ()
	
	table = new ValueTable ();
	table.Columns.Add ( "Ref", new TypeDescription ( "CatalogRef.Scenarios" ) );
	for each scenario in AllScenarios do
		row = table.Add ();
		row.Ref = scenario;
	enddo; 
	return table;
	
EndFunction 

&AtServer
Procedure userScenarios ()
	
	s = "
	|select Editing.Scenario as Scenario
	|from InformationRegister.Editing as Editing
	|where Editing.Scenario in ( &Scenarios )
	|and Editing.User = &User
	|";
	q = new Query ( s );
	q.SetParameter ( "User", SessionParameters.User );
	q.SetParameter ( "Scenarios", AllScenarios );
	Stored = q.Execute ().Unload ().UnloadColumn ( "Scenario" );

EndProcedure

&AtServer
Procedure unlockScenarios ()
	
	for each scenario in Stored do
		r = InformationRegisters.Editing.CreateRecordManager ();
		r.Scenario = scenario;
		r.Delete ();
	enddo; 
	
EndProcedure

&AtServer
Procedure createVersions ()
	
	for each scenario in Stored do
		Catalogs.Versions.Create ( scenario, Memo );
	enddo; 

EndProcedure 

&AtClient
Procedure broadcast ( Scenarios )
	
	Notify ( Enum.MessageStored (), Scenarios );
	NotifyChanged ( Type ( "CatalogRef.Scenarios" ) );
	
EndProcedure 

// *****************************************
// *********** Table List

&AtClient
Procedure ListBeforeAddRow ( Item, Cancel, Clone, Parent, Folder, Parameter )
	
	Cancel = true;
	
EndProcedure

&AtClient
Procedure ListBeforeDeleteRow ( Item, Cancel )
	
	Cancel = true;
	
EndProcedure
